//  Написать программу вычисления значения функции y = f(a)

// start

double Func(double a)
{
    double y = a*a+1;

    return y;
}


double res = Func(2.5);

Console.WriteLine(res);

// end